# (실습) 데이터프레임 중심 프로그래밍

In [28]:
import numpy as np
import pandas as pd

**문제 1**

아래의 딕셔너리 `data`를 이용하여 데이터프레임`df1`를 생성하라.

In [29]:
data = {'A': [0, 5, 15, 20, 25, 30, 35, 40],
        'B' : [1, 2, 3, 4, 5, 6, 7, 8]}

In [49]:
# None 을 적절한 표현식으로 대체하라.

df1 = pd.DataFrame(data)

df1

    A  B
0   0  1
1   5  2
2  15  3
3  20  4
4  25  5
5  30  6
6  35  7
7  40  8

**문제 2**

다음 두 리스트를 이용하여 `C`와 `D`열을 `df1`에 추가하라.

In [31]:
C = [3, 3, 3, 3, 3, 3, 3, 3]
D = [4, 2, 9, 1, 20, 3, 15, 17]

In [52]:
# pass 를 적절한 명령문으로 대체하라.

df1['C'] = C
df1['D'] = D

df1

    A  B  C   D
0   0  1  3   4
1   5  2  3   2
2  15  3  3   9
3  20  4  3   1
4  25  5  3  20
5  30  6  3   3
6  35  7  3  15
7  40  8  3  17

**문제 3**

`df1`의 각 열의 합을 계산하는 한줄 코드를 작성하라.

In [ ]:
# pass 를 한줄 코드로 대체하라.

df1.add()

TypeError: DataFrame.add() missing 1 required positional argument: 'other'

**문제 4**

`df1`의 각 행의 합을 계산하는 한줄 코드를 작성하라.

In [34]:
# pass 를 한줄 코드로 대체하라.

**문제 5**

`A`, `B`, `D`열에서 행 인덱스가 2, 3, 4인 자료를 추출하는
한줄 코드를 작성하라.

In [35]:
# pass 를 한줄 코드로 대체하라.

pass

**문제 6**

`df1`에 `K`열을 추가하여라. 이때, `K`열의 각 항목은 `B`열의 각 항목 곱하기 3이다.

In [36]:
# pass 를 한줄 코드로 대체하라.

pass

df1

    A  B  C   D
0   0  1  3   4
1   5  2  3   2
2  15  3  3   9
3  20  4  3   1
4  25  5  3  20
5  30  6  3   3
6  35  7  3  15
7  40  8  3  17

**문제 7**

`df1`에 `R`열을 추가하여라.
이때, `R`열의 각 항목은 균등분포에 따라 `[0, 1)` 구간에서 선택된 임의의 수로 구성된다.

힌트: `numpy.random.rand()`

In [37]:
# pass를 한줄 코드로 대체하라.

pass

df1

    A  B  C   D
0   0  1  3   4
1   5  2  3   2
2  15  3  3   9
3  20  4  3   1
4  25  5  3  20
5  30  6  3   3
6  35  7  3  15
7  40  8  3  17

**문제 8**

`df1`에서 `C`열에 인덱스가 1, 3, 5인 자료의 값을 6으로 변경하여라.

In [38]:
# pass 를 한줄 코드로 대체하라.

pass

df1

    A  B  C   D
0   0  1  3   4
1   5  2  3   2
2  15  3  3   9
3  20  4  3   1
4  25  5  3  20
5  30  6  3   3
6  35  7  3  15
7  40  8  3  17

**성적 데이터 분석**

학생 100명의 국어, 영어, 수학, 사회, 과학 점수가 들어 있는
`score.txt` 파일을 다운로드 한다.

- 다운로드 경로 지정

In [39]:
from pathlib import Path

data_path = Path() / "data"

data_path.mkdir(parents=True, exist_ok=True)

- 다운로드 함수 선언

In [40]:
from urllib.request import urlretrieve

# 파일 서버 기본 주소
base_url = "https://raw.githubusercontent.com/codingalzi/datapy/master/jupyter-book/data/"

def myWget(filename):
    # 다운로드 대상 파일 경로
    file_url = base_url + filename

    # 저장 경로와 파일명
    target_path = data_path / filename

    return urlretrieve(file_url, target_path)

* `score.txt` 파일 다운로드

In [41]:
myWget("score.txt")

(WindowsPath('data/score.txt'), <http.client.HTTPMessage at 0x20fa5ae15e0>)

파일의 내용을 데이터프레임으로 다음과 같이 불러온다.

In [42]:
df_score = pd.read_csv(data_path / 'score.txt', header=0)

In [43]:
df_score

    # 국어   영어   수학   사회   과학
0     15   16   21    0   14
1     96   91   14   11   75
2     49   63   15   18   61
3     54    4   20   21    1
4     46    8    7   23    9
..   ...  ...  ...  ...  ...
95    69   61   11   28   97
96    41   97   16   13    8
97     0   84   18    9   15
98    19   11   15    2   90
99     0    7   33    7   58

[100 rows x 5 columns]

**문제 9**

첫째 열의 라벨인 `# 국어` 를 `국어`로 수정하라.

In [44]:
# pass 를 한줄 코드로 대체하라.

passs

df_score

NameError: name 'passs' is not defined

**문제 10**

`df_score`의 처음부터 5개의 행을 확인하라.

힌트: `head()` 메서드

In [ ]:
# pass 를 한줄 코드로 대체하라.

pass

**문제 11**

`df_score`의 마지막 10개의 행을 확인하라.

In [ ]:
# pass 를 한줄 코드로 대체하라.

pass

**문제 12**

국어 점수가 90점 이상인 학생들의 데이터만 추출하라.

In [ ]:
# pass 를 한줄 코드로 대체하라.

pass

**문제 13**

각 과목에서 10점 이하의 값들은 `np.nan`으로 변경하여라.

In [ ]:
# pass 를 한줄 코드로 대체하라.

pass

df_score

**문제 14**

각 열에 있는 결측치의 수를 확인하라.

In [ ]:
# pass 를 한줄 코드로 대체하라.

pass

**문제 15**

결측치의 개수가 20%인 이하인 열들만 담은 데이터프레임`df_score_20`을 만들어라.

In [ ]:
# pass와 None을 각각 적절한 코드와 표현식으로 대체하라.

pass
df_score_20 = None

df_score_20

**문제 16**

아래 데이터프레임을 생성하기 위해 `pd.date_range()` 함수는 시간으로 구성된 인덱스 자료형을 생성한다.
함수 호출에 사용된 키워드 인자의 의미는 다음과 같다.

- `start="20130101`: 2013년 1월 1일부터 시작
- `periods=6`: 첫째 인자로 지정된 시간부터 6 개의 시간 데이터 샘플 생성
- `freq="D"`: 시간 데이터 샘플을 일(day) 단위로 생성

In [ ]:
dates = pd.date_range(start="20130101", periods=6, freq="D")
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
np.random.seed(0)

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-03 -0.103219  0.410599  0.144044  1.454274
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-05  1.494079 -0.205158  0.313068 -0.854096
2013-01-06 -2.552990  0.653619  0.864436 -0.742165

(1) 열 라벨을 기준으로 오름차순으로 정렬하라.

In [ ]:
# pass와 None을 각각 적절한 코드와 표현식으로 대체하라.

None

(2) 열 라벨을 기준으로 내림차순으로 정렬하라.

In [ ]:
# pass와 None을 각각 적절한 코드와 표현식으로 대체하라.

None

(2) `'B'` 라벨 열의 항목을 기준으로 오름차순으로 정렬하라.

In [ ]:
# pass와 None을 각각 적절한 코드와 표현식으로 대체하라.

None